Процедура ПроверитьРегистрациюБесплатныхСервисов (Контрагент, Сервис) экспорт
	
	наборЗАписей = РегистрыСведений.С_РегистрацияСервисов.СоздатьНаборЗаписей();
	наборЗаписей.Отбор.ПользовательСервиса.Установить(Контрагент);
	наборЗаписей.Отбор.Сервис.Установить(Сервис);
	НаборЗАписей.Прочитать();
	
	Если наборЗАписей.Количество() = 0 Тогда
		Запись = НаборЗаписей.Добавить();
		Запись.ПользовательСервиса = Контрагент;
		Запись.Включен = Истина;
		Запись.Сервис = Сервис;
		
		Запись.ДатаДействияС = Дата('20170101');
		Запись.ДатаДействияпо = Дата('20190101');
		НаборЗАписей.Записать();
	КонецЕсли;
	
конецПроцедуры