
Процедура  ПроверитьКонтрагентовВРеестреПравонарушений(ЗаписьТекст, МассивУНПКонтрагента,  КодОшибки, Отказ, ЕстьТекст = Ложь)Экспорт	
		
	Попытка	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	С_РеестрПравонарушенийСрезПоследних.УНП КАК УНП
		|ИЗ
		|	РегистрСведений.С_РеестрПравонарушений.СрезПоследних(, УНП В (&УНП)) КАК С_РеестрПравонарушенийСрезПоследних
		|";
		
		Запрос.УстановитьПараметр("УНП", МассивУНПКонтрагента);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			ЗаписьТекст = ЗаписьТекст + строка("NOOFF")+";";
			Возврат;
		КонецЕсли;
		
		Если ЕстьТекст Тогда
			ЗаписьТекст = ЗаписьТекст + строка("реестрПрав")+";";
		КонецЕсли;
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЗаписьТекст = ЗаписьТекст + ВыборкаДетальныеЗаписи.УНП + ";";
		КонецЦикла;
	Исключение		
		КодОшибки =  "OFF_CONTR_ERROR";
		Отказ = Истина;		
	КонецПопытки;	
КонецПроцедуры

Процедура  ПолучитьКонтрагентовВВЕГР(ЗаписьТекст, МассивУНПКонтрагента, КодОшибки, Отказ, ЕстьТекст = Ложь)Экспорт
	
	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	С_ЕГРСрезПоследних.УНП,
		|	С_ЕГРСрезПоследних.Наименование,
		|	С_ЕГРСрезПоследних.КодМНС,
		|	С_ЕГРСрезПоследних.ДатаИсключения
		|ИЗ
		|	РегистрСведений.С_ЕГР.СрезПоследних(, УНП В (&УНП)) КАК С_ЕГРСрезПоследних";
		
		Запрос.УстановитьПараметр("УНП", МассивУНПКонтрагента);
		РезультатЗапроса = Запрос.Выполнить();
		
		Если  РезультатЗапроса.Пустой() Тогда
			ЗаписьТекст = ЗаписьТекст + строка("ISEGR")+";";
			Возврат;
		КонецЕсли;	 
				
		ЗаписьТекст = ЗаписьТекст + строка("регистрЕГР")+";";
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЗаписьТекст = ЗаписьТекст + ВыборкаДетальныеЗаписи.УНП +"*"+ ВыборкаДетальныеЗаписи.Наименование + "*"+ ВыборкаДетальныеЗаписи.КодМНС + "*"+ ВыборкаДетальныеЗаписи.ДатаИсключения + ";";
		КонецЦикла;
	Исключение
		КодОшибки =  "OFF_CONTR_ERROR";
		Отказ = Истина;
	КонецПопытки;
	
КонецПроцедуры


