
Функция ПолучитьЗаписьXML()Экспорт	
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("Result");
	Возврат ЗаписьXML	
КонецФункции	

Процедура ДобавитьЭлементXML(ЗаписьXML, ИмяЭлемента, ЗначениеЭлемента)  Экспорт
	ЗаписьXML.ЗаписатьНачалоЭлемента(ИмяЭлемента);
	ЗаписьXML.ЗаписатьТекст(ЗначениеЭлемента);
	ЗаписьXML.ЗаписатьКонецЭлемента();	
КонецПроцедуры	

Процедура ДополнитьОписаниеОшибки(ЗаписьXML, КодОшибки, ЗаголовокОшибки, ОписаниеОшибки) Экспорт
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Error");
		ЗаписьXML.ЗаписатьНачалоЭлемента("Code");
			ЗаписьXML.ЗаписатьТекст(КодОшибки); 
		ЗаписьXML.ЗаписатьКонецЭлемента();
	
		ЗаписьXML.ЗаписатьНачалоЭлемента("Head");
			ЗаписьXML.ЗаписатьТекст(ЗаголовокОшибки); 
		ЗаписьXML.ЗаписатьКонецЭлемента();
	
		ЗаписьXML.ЗаписатьНачалоЭлемента("Description");
			ЗаписьXML.ЗаписатьТекст(ОписаниеОшибки); 
		ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры	

Процедура  ДополнитьПустыеЗаписиПриОшибке(ЗаписьXML, ЕстьЗапрос = Истина)Экспорт
	Если ЕстьЗАпрос Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("IDRequest");
		ЗаписьXML.ЗаписатьТекст("");
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
КонецПроцедуры	
