
&НаКлиенте
Процедура ПользователиПриАктивизацииСтроки(Элемент)
	
	ТекСтрока = Элемент.ТекущиеДанные;
	Если Не ТекСтрока = Неопределено Тогда 
		РегистрацияСервисов.Параметры.УстановитьЗначениеПараметра("ПользовательСервиса", ТекСтрока.Ссылка);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьСервис(Команда)
		
	Форма = ПолучитьФорму("РегистрСведений.РегистрацияСервисов.ФормаЗаписи",,ЭтаФорма);
	Форма.Запись.ПользовательСервиса = этаформа.ТекущийЭлемент.ТекущиеДанные.Ссылка;
	Форма.Запись.Включен = Истина;
	Форма.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	//Вставить содержимое обработчика
	Элементы.С_РегистрацияСервисов.Обновить();
КонецПроцедуры


&НаКлиенте
Процедура РегистрацияСервисовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	

	ТекДанные = этаформа.ТекущийЭлемент.ТекущиеДанные;
		
	Отказ = Истина;
	Ключ = Новый Структура;
	Ключ.Вставить("ПользовательСервиса", ТекДанные.Ссылка);
	Ключ.Вставить("Сервис", ТекДанные.Сервис);
	Ключ.Вставить("Партнер", ТекДанные.Партнер);
	Ключ.Вставить("IDDOCREQUEST", ТекДанные.IDDOCREQUEST);
	Ключ.Вставить("IDSERVICE", ТекДанные.IDSERVICE);
	Ключ.Вставить("IDSERVICEVA", ТекДанные.IDSERVICEVA);

	
	ПараметрыМассив = Новый Массив;
    ПараметрыМассив.Добавить(Ключ); // помещаем структуру в массив
    КлючЗаписиРегистра = Новый("РегистрСведенийКлючЗаписи.РегистрацияСервисов", ПараметрыМассив); //с помощью массива со структурой создаем ключ записи
    ОткрытьФорму("РегистрСведений.РегистрацияСервисов.ФормаЗаписи", Новый Структура("Ключ", КлючЗаписиРегистра),ЭтаФорма); // передаем в форму ключ записи и открываем её

КонецПроцедуры


&НаКлиенте
Процедура УНПОтборПриИзменении(Элемент)
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Пользователи,
		"УНП",
		УНП,
		ВидСравненияКомпоновкиДанных.Содержит,,
		ЗначениеЗаполнено(УНП));

КонецПроцедуры


&НаКлиенте
Процедура РегистрационныйНомерОсновнойПоставкиПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Пользователи,
		"РегистрационныйНомерОсновнойПоставки",
		РегистрационныйНомерОсновнойПоставки,
		ВидСравненияКомпоновкиДанных.Содержит,,
		ЗначениеЗаполнено(РегистрационныйНомерОсновнойПоставки));

КонецПроцедуры


&НаКлиенте
Процедура НаименованиеОрганизацииПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Пользователи,
		"НаименованиеОрганизации",
		НаименованиеОрганизации,
		ВидСравненияКомпоновкиДанных.Содержит,,
		ЗначениеЗаполнено(НаименованиеОрганизации));

КонецПроцедуры


&НаКлиенте
Процедура РегистрационныйНомерКонфигурацииПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Пользователи,
		"РегистрационныйНомерКонфигурации",
		РегистрационныйНомерКонфигурации,
		ВидСравненияКомпоновкиДанных.Содержит,,
		ЗначениеЗаполнено(РегистрационныйНомерКонфигурации));

КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	Элементы.Пользователи.Обновить();
КонецПроцедуры
