
Функция GetServicesPOST(Запрос)
	
    Отказ = Ложь;
	КодОшибки = "";
	Ответ = Новый HTTPСервисОтвет(200);	
	
	СтруктураПараметров = С_СлужебныеПроцедурыФункцииСервер.РазобратьВходныеданные(Запрос);
	
	С_РаботаССервисамиСлужебный.ПроверитьОбщийДоступКСервисам(СтруктураПараметров,  Ответ, КодОшибки, Отказ);

	Если Отказ Тогда
		Возврат Ответ
	КонецЕсли;
	
	С_РаботаССервисамиСлужебный.ЗарегистрироватьИспользованиеСервиса(СтруктураПараметров, Справочники.С_Сервисы.BanksClassifier, КодОшибки, Отказ);
	
	Если Отказ Тогда
		С_СлужебныеПроцедурыФункцииСервер.УстановитьКодОшибки(Ответ, КодОшибки);
		Возврат Ответ
	КонецЕсли;
	ДанныеСервиса =  ПолучитьДанныеСервиса(СтруктураПараметров, КодОшибки, Отказ);																
	Ответ.Заголовки["Content-Type"] =  "text/xml;charset=UTF-8";
    Ответ.УстановитьТелоИзСтроки(ДанныеСервиса, КодировкаТекста.UTF8,ИспользованиеByteOrderMark.НеИспользовать);
	Возврат Ответ;	
	
КонецФункции

Функция ПолучитьДанныеСервиса(СтруктураПараметров, КодОшибки, Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РегистрацияСервисов.Включен,
	|	РегистрацияСервисов.ДатаДействияС,
	|	РегистрацияСервисов.ДатаДействияПо,
	|	РегистрацияСервисов.Сервис
	|ИЗ
	|	РегистрСведений.С_РегистрацияСервисов КАК РегистрацияСервисов
	|ГДЕ
	|	РегистрацияСервисов.ПользовательСервиса = &ПользовательСервиса
	|	И РегистрацияСервисов.Сервис В(&Сервис)
	|	И РегистрацияСервисов.Включен = Истина
	|	И РегистрацияСервисов.ДатаДействияПо >= &ДатаДействияПо";
		
	Запрос.УстановитьПараметр("ПользовательСервиса", СтруктураПараметров.ПользовательСервиса);
	
	МассивСервисов = Новый Массив;
	МассивСервисов.Добавить(Справочники.С_Сервисы.Bankrupt);
	МассивСервисов.Добавить(Справочники.С_Сервисы.BanksClassifier);
	МассивСервисов.Добавить(Справочники.С_Сервисы.OffContractors);
	МассивСервисов.Добавить(Справочники.С_Сервисы.AddressClassifier);
	Запрос.УстановитьПараметр("Сервис", МассивСервисов);
	Запрос.УстановитьПараметр("ДатаДействияПо", СтруктураПараметров.РабочаяДата);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка =  РезультатЗапроса.Выбрать();
	
	ЗаписьXML = С_ФормированиеXMLСервер.ПолучитьЗаписьXML();
	
	Пока Выборка.Следующий() Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("Items");
		ЗаписьXML.ЗаписатьАтрибут("dateEnd",Формат(Выборка.ДатаДействияПо, "ДФ=yyyyMMdd"));	
		ЗаписьXML.ЗаписатьАтрибут("service",Строка(Выборка.Сервис.ИмяПредопределенныхДанных));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	Возврат ЗаписьXML.Закрыть();		
КонецФункции	
