
Функция ПолучитьПользователяСервисов(СтруктураПараметров, КодОшибки, Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПользователиСервисов.Ссылка КАК Пользователь
		|ИЗ
		|	Справочник.С_ПользователиСервисов КАК ПользователиСервисов
		|ГДЕ
		|	ПользователиСервисов.УНП = &УНП
		|	И ПользователиСервисов.РегистрационныйНомерОсновнойПоставки = &РегистрационныйНомерОсновнойПоставки";
	Запрос.УстановитьПараметр("РегистрационныйНомерОсновнойПоставки", СтруктураПараметров.ID_ITS_REGNUM);
	Запрос.УстановитьПараметр("УНП", СтруктураПараметров.ID_ORG_UNP);	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		НовыйПользователь = СоздатьНовогоПользователяСервисов(СтруктураПараметров);
		Если НовыйПользователь = Неопределено Тогда
			Отказ = Истина;
			КодОшибки = "USER_WRITE_ERROR";
			Возврат НовыйПользователь;
		КонецЕсли;
		С_РаботаССервисамиСлужебный.УстановитьБесплатныеСервисыДляНовогоПользователя(НовыйПользователь);	
		Возврат НовыйПользователь
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Пользователь;
	КонецЕсли;
		
КонецФункции	

Функция СоздатьНовогоПользователяСервисов(СтруктураПараметров) 
	Попытка
		НовыйПользовательОбъект = Справочники.C_ПользователиСервисов.СоздатьЭлемент();
		НовыйПользовательОбъект.УНП = СтруктураПараметров.ID_ORG_UNP;
		НовыйПользовательОбъект.Наименование = СтруктураПараметров.ID_ORG_UNP;
		НовыйПользовательОбъект.РегистрационныйНомерОсновнойПоставки = СтруктураПараметров.ID_ITS_REGNUM;
		НовыйПользовательОбъект.РегистрационныйНомерКонфигурации = СтруктураПараметров.ID_CONFIG_REGNUM;
		НовыйПользовательОбъект.НаименованиеОрганизации = СтруктураПараметров.ID_ORG_NAME;
		НовыйПользовательОбъект.Записать();
	Исключение
		Возврат Неопределено
	КонецПопытки;
	Возврат НовыйПользовательОбъект.Ссылка
КонецФункции
	
Процедура ЗарегистрироватьДействиеПользователя(СтруктураПараметров,  Действие) Экспорт
	
	ВестиЛогПользователей = Константы.С_ВестиЛогПользователей.Получить();
	Если НЕ ВестиЛогПользователей Тогда
		Возврат;
	КонецЕсли;	
		
	ID_CONFIG_VER = "";
	Если  СтруктураПараметров.Свойство("ID_CONFIG_VER") Тогда
		ID_CONFIG_VER = СтруктураПараметров.ID_CONFIG_VER;
	КонецЕсли;	
		
	Записи = РегистрыСведений.С_РегистрацияДействийПользователей.СоздатьНаборЗаписей();
	Записи.Отбор.УНП.Установить(СтруктураПараметров.ID_ORG_UNP);
	Записи.Отбор.РегистрационныйНомерОсновнойПоставки.Установить(СтруктураПараметров.ID_ITS_REGNUM);
	Записи.Отбор.Период.Установить(СтруктураПараметров.РабочаяДата);
	Записи.Отбор.Действие.Установить(Действие);
	Записи.Прочитать();
		
	Если Записи.Количество() > 0 Тогда
		Возврат
	КонецЕсли;	
			
	Запись = Записи.Добавить();
	Запись.РегистрационныйНомерОсновнойПоставки = СтруктураПараметров.ID_ITS_REGNUM;
	Запись.УНП = СтруктураПараметров.ID_ORG_UNP;
	Запись.Действие = Действие;
	Запись.Период = СтруктураПараметров.РабочаяДата;
	Запись.НазваниеОрганизации = СтруктураПараметров.ID_ORG_NAME;		
	Запись.Конфигурация = СтруктураПараметров.ID_CONFIG_VER;
	Попытка
		Записи.Записать();
	Исключение
		
	КонецПопытки
	
КонецПроцедуры

