

&НаКлиенте
Процедура ЗарегистрироватьСервис(Команда)
	
	
	Форма = ПолучитьФорму("РегистрСведений.РегистрацияСервисов.ФормаЗаписи");
	Форма.Запись.ПользовательСервиса = этаформа.ТекущийЭлемент.ТекущиеДанные.Ссылка;
	Форма.Запись.Включен = Истина;
	//Форма.Запись. = ПредопределенноеЗначение("Справочник.ВидыДокументов.ПаспортРФ");//Если, конечно, "ПаспортРФ" - это предопределенный элемент справочника.
	Форма.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура УНПОтборПриИзменении(Элемент)
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"УНП",
		УНП,
		ВидСравненияКомпоновкиДанных.Содержит,,
		ЗначениеЗаполнено(УНП));

КонецПроцедуры


&НаКлиенте
Процедура РегистрационныйНомерОсновнойПоставкиПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"РегистрационныйНомерОсновнойПоставки",
		РегистрационныйНомерОсновнойПоставки,
		ВидСравненияКомпоновкиДанных.Содержит,,
		ЗначениеЗаполнено(РегистрационныйНомерОсновнойПоставки));

КонецПроцедуры


&НаКлиенте
Процедура НаименованиеОрганизацииПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"НаименованиеОрганизации",
		НаименованиеОрганизации,
		ВидСравненияКомпоновкиДанных.Содержит,,
		ЗначениеЗаполнено(НаименованиеОрганизации));

КонецПроцедуры


&НаКлиенте
Процедура РегистрационныйНомерКонфигурацииПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"РегистрационныйНомерКонфигурации",
		РегистрационныйНомерКонфигурации,
		ВидСравненияКомпоновкиДанных.Содержит,,
		ЗначениеЗаполнено(РегистрационныйНомерКонфигурации));

КонецПроцедуры

