
Функция KontrInfoOST(Запрос)
		
	Отказ = Ложь;
	КодОшибки = "";
	Ответ = Новый HTTPСервисОтвет(200);	
	
	СтруктураПараметров = С_СлужебныеПроцедурыФункцииСервер.РазобратьВходныеданные(Запрос);
	
	С_РаботаССервисамиСлужебный.ПроверитьОбщийДоступКСервисам(СтруктураПараметров,  Ответ, КодОшибки, Отказ);

	Если Отказ Тогда
		Возврат Ответ
	КонецЕсли;
	
	С_РаботаССервисамиСлужебный.ЗарегистрироватьИспользованиеСервиса(СтруктураПараметров, Справочники.С_Сервисы.KontrInfo, КодОшибки, Отказ);
	
	Если Отказ Тогда
		С_СлужебныеПроцедурыФункцииСервер.УстановитьКодОшибки(Ответ, КодОшибки);
		Возврат Ответ
	КонецЕсли;
									
	ДвоичныеДанные = ПолучитьДанныеСервиса(СтруктураПараметров, Ответ,  КодОшибки, Отказ);
	
	Если Отказ Тогда
		С_СлужебныеПроцедурыФункцииСервер.УстановитьКодОшибки(Ответ, КодОшибки);
		Возврат Ответ; 
	КонецЕсли;	

	//Ответ.УстановитьТелоИзДвоичныхДанных(ДвоичныеДанные);							
	Возврат Ответ;	

КонецФункции

Функция ПолучитьДанныеСервиса(СтруктураПараметров, Ответ, КодОшибки, Отказ)
	
	ВерсииКонтактов = Неопределено;
	ВерсииБанковскихСчетов = Неопределено;
	ВерсииКонтактнойИнформации  = Неопределено;

	
	Если  СтруктураПараметров.Свойство("ID_CONTR_UNP_BANK") Тогда
		ВерсииБанковскихСчетов = СокрЛП(СтруктураПараметров.ID_CONTR_UNP_BANK); 
	КонецЕсли;
	
	С_РаботаССервисамиСлужебный.ЗарегистрироватьИспользованиеСервиса(СтруктураПараметров, Справочники.С_Сервисы.BanksClassifier, КодОшибки, Отказ);
	СтруктураПараметров.Вставить("ИспользоватьБанки", ?(Отказ, Ложь, Истина));
	
	С_РаботаССервисамиСлужебный.ЗарегистрироватьИспользованиеСервиса(СтруктураПараметров, Справочники.С_Сервисы.AddressClassifier, КодОшибки, Отказ);	
	СтруктураПараметров.Вставить("ИспользоватьАдресный", ?(Отказ, Ложь, Истина));

	
	Если  СтруктураПараметров.Свойство("ID_CONTR_UNP_KONTI") Тогда
		ВерсииБанковскихСчетов = СокрЛП(СтруктураПараметров.ID_CONTR_UNP_KONTI); 
	КонецЕсли;
 		
	Если  СтруктураПараметров.Свойство("ID_CONTR_UNP_KONT")  Тогда
		ВерсииКонтактов = СокрЛП(СтруктураПараметров.ID_CONTR_UNP_KONT); 	
	КонецЕсли;

	Отказ = Ложь;
	ТекстОшибки = "";
	С_СвободныйРеестрСервер.СформироватьXMLКонтрагента(СтруктураПараметров, Ответ, ТекстОшибки, Отказ);
		
	Если ВерсииБанковскихСчетов <> Неопределено ИЛИ  ВерсииКонтактнойИнформации <> Неопределено ИЛИ ВерсииКонтактов <> Неопределено Тогда
		С_СвободныйРеестрСервер.СформироватьXMLПоОбновлениям(ВерсииКонтактов, ВерсииКонтактнойИнформации, ВерсииБанковскихСчетов, СтруктураПараметров, Ответ, ТекстОшибки, Отказ);
	КонецЕсли;	
		
	Возврат Ответ;
		
КонецФункции	
