
&НаКлиенте
Процедура ОтборУНППриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"УНП",
		ОтборУНП,
		ВидСравненияКомпоновкиДанных.Содержит,,
		ЗначениеЗаполнено(ОтборУНП));

КонецПроцедуры

&НаКлиенте
Процедура ОтборРегистрационныйНомерОсновнойПоставкиПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"РегистрационныйНомерОсновнойПоставки",
		ОтборРегистрационныйНомерОсновнойПоставки,
		ВидСравненияКомпоновкиДанных.Содержит,,
		ЗначениеЗаполнено(ОтборРегистрационныйНомерОсновнойПоставки));
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"Действие",
		ОтборДействие,
		ВидСравненияКомпоновкиДанных.равно,,
		ЗначениеЗаполнено(ОтборДействие));

КонецПроцедуры


&НаКлиенте
Процедура ОтборДействиеПриИзменении(Элемент)
	
	  ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"Действие",
		ОтборДействие,
		ВидСравненияКомпоновкиДанных.Равно,,
		ЗначениеЗаполнено(ОтборДействие));

	
КонецПроцедуры

