
&НаКлиенте
Процедура УНП1ПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"УНП",
		УНП,
		ВидСравненияКомпоновкиДанных.Содержит,,
		ЗначениеЗаполнено(УНП));

КонецПроцедуры

&НаКлиенте
Процедура РегистрационныйНомерКонфигурацииПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"РегистрационныйНомерКонфигурации",
		РегистрационныйНомерКонфигурации,
		ВидСравненияКомпоновкиДанных.Содержит,,
		ЗначениеЗаполнено(РегистрационныйНомерКонфигурации));

КонецПроцедуры
