
&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры

Процедура ЗагрузитьнаСервере()
	
	ТабличныйДокумент =  Объект.Версии;
	КолвоСтрокФайла = Объект.Версии.ВысотаТаблицы-1;
		
	Если КолвоСтрокФайла = 0 Тогда
		ТабличныйДокумент = Неопределено;
	КонецЕсли;
	
	Для ит = 1 ПО КолвоСтрокФайла Цикл
		
		нстр = СтрЗаменить(ит, Символы.НПП, "");
		
		Если  ТабличныйДокумент.ПолучитьОбласть("R"+ нстр + "C1").ТекущаяОбласть.Текст = "" Тогда
			Прервать;
		КонецЕсли;
		
		ВерсияСтр =  СокрЛП(ТабличныйДокумент.ПолучитьОбласть("R"+ нстр + "C1").ТекущаяОбласть.Текст);
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	С_ВерсииКонфигураций.Ссылка
		|ИЗ
		|	Справочник.С_ВерсииКонфигураций КАК С_ВерсииКонфигураций
		|ГДЕ
		|	С_ВерсииКонфигураций.Версия = &Версия
		|	И С_ВерсииКонфигураций.Конфигурация = &Конфигурация";
		
		Запрос.УстановитьПараметр("Версия", ВерсияСтр);
		Запрос.УстановитьПараметр("Конфигурация", Объект.Конфигурация);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			Продолжить;
		Иначе
			НовыйЭлт = Справочники.С_ВерсииКонфигураций.СоздатьЭлемент();
			НовыйЭлт.Версия = ВерсияСтр;
			НовыйЭлт.Конфигурация = Объект.Конфигурация;
			НовыйЭлт.Наименование  = Строка(Объект.Конфигурация) + " " +  Строка(ВерсияСтр);
			НовыйЭлт.Записать();
		КонецЕсли;	
			
		
    КонецЦикла;
	
	
	
КонецПроцедуры	