
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр С_РегистрацияИТС
	Движения.С_РегистрацияИТС.Записывать = Истина;
	
	Для Каждого ТекСтрокаИТС Из ИТС Цикл
		Движение = Движения.С_РегистрацияИТС.Добавить();
		Движение.Период = Дата;
		Движение.ИНН = ТекСтрокаИТС.ИНН;
		Движение.РегистрационныйНомер = ТекСтрокаИТС.РегистрационныйНомер;
		Движение.ДатаПо = ТекСтрокаИТС.ДатаПо;
		Движение.ДатаС = ТекСтрокаИТС.ДатаС;
		Движение.РучнойВвод = ТекСтрокаИТС.РучнойВвод;
		Движение.Пользователь = Ответственный;
	КонецЦикла;
	
КонецПроцедуры
