
Функция POSTRequest(Запрос)
	
	Отказ = Ложь;
	КодОшибки = "";
	Ответ = Новый HTTPСервисОтвет(200);	
	СтруктураПараметров = С_СлужебныеПроцедурыФункцииСервер.РазобратьВходныеданные(Запрос);
	
	С_РаботаССервисамиСлужебный.ПроверитьОбщийДоступКСервисам(СтруктураПараметров,  Ответ, КодОшибки, Отказ);

	Если Отказ Тогда
		Возврат Ответ
	КонецЕсли;
	
	С_РаботаССервисамиСлужебный.ЗарегистрироватьИспользованиеСервиса(СтруктураПараметров, Справочники.С_Сервисы.CurrRates, КодОшибки, Отказ);
	
	Если Отказ Тогда
		С_СлужебныеПроцедурыФункцииСервер.УстановитьКодОшибки(Ответ, КодОшибки);
		Возврат Ответ
	КонецЕсли;
									
	ДвоичныеДанные = ПолучитьДанныеСервиса(СтруктураПараметров, КодОшибки, Отказ);
	
	Если Отказ Тогда
		С_СлужебныеПроцедурыФункцииСервер.УстановитьКодОшибки(Ответ, КодОшибки);
		Возврат Ответ; 
	КонецЕсли;	

	Ответ.УстановитьТелоИзДвоичныхДанных(ДвоичныеДанные);	
	Возврат Ответ;

КонецФункции

Функция ПолучитьДанныеСервиса(СтруктураПараметров, КодОшибки, Отказ)
	
	ЗаписьТекст = "";
	ДвоичныеДанные = Неопределено;
	С_КурсыВалютСервер.ПолучитьКурсы(СтруктураПараметров.ID_CURR_LIST,
									СтруктураПараметров.ID_CURR_DATES,
									ЗаписьТекст,
									КодОШибки,
									Отказ);
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	Попытка
		ВременныйФайл = ПолучитьИмяВременногоФайла();
		Запись = Новый ЗаписьТекста();
		Запись.Открыть(ВременныйФайл);
		Запись.Записать(ЗаписьТекст);
		Запись.Закрыть();
		ДвоичныеДанные = Новый ДвоичныеДанные(ВременныйФайл);
		УдалитьФайлы(ВременныйФайл);
	Исключение	
		КодОшибки =  "CURR_RATES_ERROR";
		Отказ = Истина;
	КонецПопытки;	
	
	Возврат Двоичныеданные
КонецФункции	

