
Функция ShowLocationPOST(Запрос)
	
	Отказ = Ложь;
	КодОшибки = "";
	Ответ = Новый HTTPСервисОтвет(200);	
	СтруктураПараметров = С_СлужебныеПроцедурыФункцииСервер.РазобратьВходныеданные(Запрос);
	С_РаботаССервисамиСлужебный.ПроверитьОбщийДоступКСервисам(СтруктураПараметров,  Ответ, КодОшибки, Отказ);

	Если Отказ Тогда
		Возврат Ответ
	КонецЕсли;
	
	С_РаботаССервисамиСлужебный.ЗарегистрироватьИспользованиеСервиса(СтруктураПараметров, Справочники.С_Сервисы.BanksClassifier, КодОшибки, Отказ);
	
	Если Отказ Тогда
		С_СлужебныеПроцедурыФункцииСервер.УстановитьКодОшибки(Ответ, КодОшибки);
		Возврат Ответ
	КонецЕсли;
																							
	ДвоичныеДанные = ПолучитьДанныеСервиса(СтруктураПараметров, КодОшибки, Отказ);
	
	Если Отказ Тогда
		С_СлужебныеПроцедурыФункцииСервер.УстановитьКодОшибки(Ответ, КодОшибки);
		Возврат Ответ; 
	КонецЕсли;	

	Ответ.УстановитьТелоИзДвоичныхДанных(ДвоичныеДанные);	
	Возврат Ответ;

КонецФункции

Функция ПолучитьДанныеСервиса(СтруктураПараметров, КодОшибки, Отказ)
	  		
	Адрес = "";
	Если  СтруктураПараметров.Свойство("ID_ADDRESS") Тогда
		Адрес = СокрЛП(СтруктураПараметров.ID_ADDRESS); 
	КонецЕсли;
	
	 ИмяКартографическогоСервиса = "";
	 Если  СтруктураПараметров.Свойство("ID_SERVICE") Тогда
		ИмяКартографическогоСервиса = СокрЛП(СтруктураПараметров.ID_SERVICE); 
	КонецЕсли;

	АдресКодированный = УправлениеКонтактнойИнформацией.URLEncode(Адрес);			
	Если ИмяКартографическогоСервиса = "GoogleMaps" Тогда
		СтрокаЗапуска = "https://maps.google.ru/?q=" + АдресКодированный;
	Иначе
		СтрокаЗапуска = "https://maps.yandex.ru/?text=" + АдресКодированный;
	КонецЕсли;
	
	Попытка	
		ВременныйФайл = ПолучитьИмяВременногоФайла();
		Запись = Новый ЗаписьТекста();
		Запись.Открыть(ВременныйФайл);
		Запись.Записать(СтрокаЗапуска);
		Запись.Закрыть();
		ДвоичныеДанные = Новый ДвоичныеДанные(ВременныйФайл);
		УдалитьФайлы(ВременныйФайл);
	Исключение	
		КодОшибки =  "ADDR_NOT_USED";
		Отказ = Истина;
		Возврат Неопределено; 
	КонецПопытки;
	
	Возврат ДвоичныеДанные
КонецФункции	

