
Функция AddressClassifierPOST(Запрос)

Отказ = Ложь;
	КодОшибки = "";
	Ответ = Новый HTTPСервисОтвет(200);	
	
	СтруктураПараметров = С_СлужебныеПроцедурыФункцииСервер.РазобратьВходныеданные(Запрос);
	
	С_РаботаССервисамиСлужебный.ПроверитьОбщийДоступКСервисам(СтруктураПараметров,  Ответ, КодОшибки, Отказ);

	Если Отказ Тогда
		Возврат Ответ
	КонецЕсли;
	
	С_РаботаССервисамиСлужебный.ЗарегистрироватьИспользованиеСервиса(СтруктураПараметров, Справочники.С_Сервисы.BanksClassifier, КодОшибки, Отказ);
	
	Если Отказ Тогда
		С_СлужебныеПроцедурыФункцииСервер.УстановитьКодОшибки(Ответ, КодОшибки);
		Возврат Ответ
	КонецЕсли;
									
	ДвоичныеДанные = ПолучитьДанныеСервиса(СтруктураПараметров.id_address_list, КодОшибки, Отказ);
	
	Если Отказ Тогда
		С_СлужебныеПроцедурыФункцииСервер.УстановитьКодОшибки(Ответ, КодОшибки);
		Возврат Ответ; 
	КонецЕсли;	
	
	Ответ.УстановитьТелоИзДвоичныхДанных(ДвоичныеДанные);							
	Возврат Ответ;	

КонецФункции

Функция ПолучитьДанныеСервиса(МассивРегионов, КодОшибки, Отказ)
	
	ДвоичныеДанные = Неопределено;
	ЗаписьТекст = "";	
	С_АдресныйКлассификаторСервер.ПолучитьАдресныйклассификатор(МассивРегионов, 
											ЗаписьТекст,
											КодОшибки, Отказ);
	
	Попытка
		
		ВременныйФайл = ПолучитьИмяВременногоФайла();
		Запись = Новый ЗаписьТекста();
		Запись.Открыть(ВременныйФайл);
		Запись.Записать(ЗаписьТекст);
		Запись.Закрыть();
		ДвоичныеДанные = Новый ДвоичныеДанные(ВременныйФайл);
		УдалитьФайлы(ВременныйФайл);		
	Исключение
		КодОшибки =  "ADDR_ERROR";
		Отказ = Истина;	
	КонецПопытки;	
	
	Возврат ДвоичныеДанные;
	
КонецФункции
	
